# Importing tables from SQL

In [3]:
import pandas as pd
import numpy as np
from sql_functions import get_dataframe_cp

## products_dataset

In [4]:
products = get_dataframe_cp('SELECT * FROM e_commerce.products_dataset')
products.head()

,product_id,product_name_length,product_description_length,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm,product_category_name_english
0,1e9e8ef04dbcff4541ed26657ea517e5,40.0,287.0,1.0,225.0,16.0,10.0,14.0,perfumery
1,3aa071139cb16b67ca9e5dea641aaa2f,44.0,276.0,1.0,1000.0,30.0,18.0,20.0,art
2,96bd76ec8810374ed1b65e291975717f,46.0,250.0,1.0,154.0,18.0,9.0,15.0,sports_leisure
3,cef67bcfe19066a932b7673e239eb23d,27.0,261.0,1.0,371.0,26.0,4.0,26.0,baby
4,9dc1a7de274444849c219cff195d0b71,37.0,402.0,4.0,625.0,20.0,17.0,13.0,housewares

In [5]:
products.drop(['product_name_length', 'product_description_length'], axis=1, inplace=True)
products.head()

,product_id,product_photos_qty,product_weight_g,product_length_cm,product_height_cm,product_width_cm,product_category_name_english
0,1e9e8ef04dbcff4541ed26657ea517e5,1.0,225.0,16.0,10.0,14.0,perfumery
1,3aa071139cb16b67ca9e5dea641aaa2f,1.0,1000.0,30.0,18.0,20.0,art
2,96bd76ec8810374ed1b65e291975717f,1.0,154.0,18.0,9.0,15.0,sports_leisure
3,cef67bcfe19066a932b7673e239eb23d,1.0,371.0,26.0,4.0,26.0,baby
4,9dc1a7de274444849c219cff195d0b71,4.0,625.0,20.0,17.0,13.0,housewares

## order_items_dataset

In [6]:
items = get_dataframe_cp('SELECT * FROM e_commerce.order_items_dataset')
items.head()

,order_id,item_quantity,product_id,seller_id,shipping_limit_date,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,48436dade18ac8b2bce089ec2a041202,2017-09-19 09:45:35,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,dd7ddc04e1b6c2c614352b383efe2d36,2017-05-03 11:05:13,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,5b51032eddd242adc84c38acab88f23d,2018-01-18 14:48:30,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,9d7a1d34a5052409006425275ba1c2b4,2018-08-15 10:10:18,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,df560393f3a51e74553ab94004ba5c87,2017-02-13 13:57:51,199.90,18.14

In [7]:
items.drop(['seller_id', 'shipping_limit_date'], axis=1, inplace=True)
items.head()

,order_id,item_quantity,product_id,price,freight_value
0,00010242fe8c5a6d1ba2dd792cb16214,1,4244733e06e7ecb4970a6e2683c13e61,58.90,13.29
1,00018f77f2f0320c557190d7a144bdd3,1,e5f2d52b802189ee658865ca93d83a8f,239.90,19.93
2,000229ec398224ef6ca0657da4fc703e,1,c777355d18b72b67abbeef9df44fd0fd,199.00,17.87
3,00024acbcdf0a6daa1e931b038114c75,1,7634da152a4610f1595efa32f14722fc,12.99,12.79
4,00042b26cf59d7ce69dfabb4e55b4fd9,1,ac6c3623068f30de03045865e4e10089,199.90,18.14

## order_payments_dataset

In [8]:
payments = get_dataframe_cp('SELECT * FROM e_commerce.order_payments_dataset')
payments.head()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45

## geolocation_avg_dataset

In [9]:
geo_avg = get_dataframe_cp('SELECT * FROM e_commerce.geolocation_avg_dataset')
geo_avg.head()

,geolocation_zip_code_prefix,avg_geolocation_lat,avg_geolocation_lan,geolocation_city,geolocation_state
0,1001,-23.550388,-46.634041,sao paulo,SP
1,1001,-23.549998,-46.634060,são paulo,SP
2,1002,-23.548260,-46.635353,sao paulo,SP
3,1002,-23.544641,-46.633180,são paulo,SP
4,1003,-23.548981,-46.635741,sao paulo,SP

In [11]:
geo_avg.drop(['geolocation_city', 'geolocation_state'], axis=1, inplace=True)
geo_avg.head()

   geolocation_zip_code_prefix  avg_geolocation_lat  avg_geolocation_lan
0                         1001           -23.550388           -46.634041
1                         1001           -23.549998           -46.634060
2                         1002           -23.548260           -46.635353
3                         1002           -23.544641           -46.633180
4                         1003           -23.548981           -46.635741

In [23]:
geo_avg.rename(columns={'geolocation_zip_code_prefix': 'zip_code_prefix', 'avg_geolocation_lan': 'avg_geolocation_lng'}, inplace=True)
geo_avg.head()

   zip_code_prefix  avg_geolocation_lat  avg_geolocation_lng
0             1001           -23.550388           -46.634041
1             1001           -23.549998           -46.634060
2             1002           -23.548260           -46.635353
3             1002           -23.544641           -46.633180
4             1003           -23.548981           -46.635741

In [24]:
geo_avg.duplicated().value_counts()

False    27646
dtype: int64

In [16]:
geo_avg.shape

(27646, 3)

## sellers_dataset

In [10]:
sellers = get_dataframe_cp('SELECT * FROM e_commerce.sellers_dataset')
sellers.head()

                          seller_id  seller_zip_code_prefix
0  3442f8959a84dea7ee197c632cb2df15                   13023
1  d1b65fc7debc3361ea86b5f14c68d2e2                   13844
2  ce3ad9de960102d0677a81f5d0bb7b2d                   20031
3  c0f3eea2e14555b6faeea3dd58c1b1c3                    4195
4  51a04a8a6bdcb23deccc82b0b80742cf                   12914

In [12]:
sellers.rename(columns={'seller_zip_code_prefix': 'zip_code_prefix'}, inplace=True)
sellers.head()

                          seller_id  zip_code_prefix
0  3442f8959a84dea7ee197c632cb2df15            13023
1  d1b65fc7debc3361ea86b5f14c68d2e2            13844
2  ce3ad9de960102d0677a81f5d0bb7b2d            20031
3  c0f3eea2e14555b6faeea3dd58c1b1c3             4195
4  51a04a8a6bdcb23deccc82b0b80742cf            12914

In [25]:
sellers.duplicated().value_counts()

False    3095
dtype: int64

In [15]:
sellers.shape

(3095, 2)

# Augmentation

## sellers_geolocation_dataset

In [22]:
sellers_geolocation_dataset = pd.merge(sellers, geo_avg, on= 'zip_code_prefix')
sellers_geolocation_dataset.head()

,seller_id,zip_code_prefix,avg_geolocation_lat,avg_geolocation_lan
0,3442f8959a84dea7ee197c632cb2df15,13023,-22.893317,-47.060596
1,e0eabded302882513ced4ea3eb0c7059,13023,-22.893317,-47.060596
2,d1b65fc7debc3361ea86b5f14c68d2e2,13844,-22.381504,-46.948024
3,d1b65fc7debc3361ea86b5f14c68d2e2,13844,-22.383624,-46.947170
4,d1b65fc7debc3361ea86b5f14c68d2e2,13844,-22.384177,-46.949776

In [21]:
sellers_geolocation_dataset.shape

(4716, 4)

In [26]:
sellers_geolocation_dataset.duplicated().value_counts()

False    4716
dtype: int64

# Pushing to SQL

In [27]:
from sql_functions import get_engine_cp
from sql_functions import push_to_database
import psycopg2

In [28]:
schema = 'e_commerce'
engine = get_engine_cp()

In [ ]:
# table_name = 'sellers_geolocation_dataset'                                                                                     

# push_to_database(df=sellers_geolocation_dataset, table_name=table_name, engine=engine, schema=schema)